#ifndef _WDT_DRV_H_
#define _WDT_DRV_H_

#include "STC12C5A60S2.h"

#define Wdt_enable()    (WDT_CONTR = 0x36)    //直接赋值, 2.27s
#define Wdt_refresh()   (WDT_CONTR = 0x36)    //直接赋值, 2.27s

                         //当主频为 11.0592MHz 时
						 //   0x31 - 使能和清除看门狗,空闲时不计数，溢出时间为142ms.
						 //   0x32 - 使能和清除看门狗,空闲时不计数，溢出时间为284ms.
						 //   0x33 - 使能和清除看门狗,空闲时不计数，溢出时间为569ms.
						 //   0x34 - 使能和清除看门狗,空闲时不计数，溢出时间为1.13s.
						 //   0x35 - 使能和清除看门狗,空闲时不计数，溢出时间为2.27s.
						 //   0x36 - 使能和清除看门狗,空闲时不计数，溢出时间为4.5s.
						 //   0x37 - 使能和清除看门狗,空闲时不计数，溢出时间为9s.

                         //当主频为 22.1184MHz 时
						 //   0x31 - 使能和清除看门狗,空闲时不计数，溢出时间为71ms.
						 //   0x32 - 使能和清除看门狗,空闲时不计数，溢出时间为142ms.
						 //   0x33 - 使能和清除看门狗,空闲时不计数，溢出时间为284ms.
						 //   0x34 - 使能和清除看门狗,空闲时不计数，溢出时间为556s.
						 //   0x35 - 使能和清除看门狗,空闲时不计数，溢出时间为1.13s.
						 //   0x36 - 使能和清除看门狗,空闲时不计数，溢出时间为2.27s.
						 //   0x37 - 使能和清除看门狗,空闲时不计数，溢出时间为4.5s.
#endif
