/*H**************************************************************************
* NAME:  stress.h         
*----------------------------------------------------------------------------
* Copyright (c) 2011.
*----------------------------------------------------------------------------
* RELEASE:      2011.08.22
* REVISION:     9.2    
*----------------------------------------------------------------------------
* PURPOSE:
* This file contains the stress standard parameters.
*****************************************************************************/

#ifndef _STRESS_H_
#define _STRESS_H_

/*_____ I N C L U D E S ____________________________________________________*/

/*_____ D E F I N I T I O N ________________________________________________*/
//ZZX:  张力相关缺省参数 (单位：采样值)
#define STD_STILL_DN     0    //张力静态值下限
#define STD_STILL_UP   999    //张力静态值上限
							  
#define STD_ALARM_MIN    5    //张力报警阀值最小值
#define STD_ALARM_MAX  255    //张力报警阀值最大值

#define STD_ALARM_DEF   50    //张力报警阀值缺省值

#define DEF_ModiBASE_TH  5	  //报警状态下(连续四点超限), 允许更新基准值需要的最小变化阀值, 单位: 采样值
#define DEF_ModiBASE_PT  6    //缓慢拉紧时, 多少个计量点(一个计量点含多个均衡点)被连续拉紧, 用于跟踪基准值使递增1
                              //  例如: 为6时, 更新周期为 6 * 0.64 = 3.9 秒	  (一个计量点含2个均衡点时)

#define DEF_SAMPLE_POINT 30  //默认采样30点，以确定钢丝是否比较松

#endif    /* _STRESS_H_ */
